---
kind: method
id: M:Autodesk.Revit.DB.ParameterSet.#ctor
source: html/7200dbf8-5226-d571-6548-92bebf30cdba.htm
---
# Autodesk.Revit.DB.ParameterSet.#ctor Method

Initializes a new instance of the ParameterSet class

## Syntax (C#)
```csharp
public ParameterSet()
```